//
//  cityData.swift
//  TokyoCityQuiz2
//
//  Created by nekoribocchi on 2025/04/01.
//

import Foundation

class CityDataProvider {
    static let shared = CityDataProvider()
    
    let cityData: [String: String] = [
        "八王子市": "はちおうじし",
        "立川市": "たちかわし",
        "武蔵野市": "むさしのし",
        "三鷹市": "みたかし",
        "青梅市": "おうめし",
        "府中市": "ふちゅうし",
        "昭島市": "あきしまし",
        "調布市": "ちょうふし",
        "町田市": "まちだし",
        "小金井市": "こがねいし",
        "小平市": "こだいらし",
        "日野市": "ひのし",
        "東村山市": "ひがしむらやまし",
        "国分寺市": "こくぶんじし",
        "国立市": "くにたちし",
        "福生市": "ふっさし",
        "狛江市": "こまえし",
        "東大和市": "ひがしやまとし",
        "清瀬市": "きよせし",
        "東久留米市": "ひがしくるめし",
        "武蔵村山市": "むさしむらやまし",
        "多摩市": "たまし",
        "稲城市": "いなぎし",
        "羽村市": "はむらし",
        "あきる野市": "あきるのし",
        "西東京市": "にしとうきょうし",
        "瑞穂町": "みずほまち",
        "日の出町": "ひのでまち",
        "檜原村": "ひのはらむら",
        "奥多摩町": "おくたままち",
        "千代田区": "ちよだく",
        "中央区": "ちゅうおうく",
        "港区": "みなとく",
        "新宿区": "しんじゅくく",
        "文京区": "ぶんきょうく",
        "台東区": "たいとうく",
        "墨田区": "すみだく",
        "江東区": "こうとうく",
        "品川区": "しながわく",
        "目黒区": "めぐろく",
        "大田区": "おおたく",
        "世田谷区": "せたがやく",
        "渋谷区": "しぶやく",
        "中野区": "なかのく",
        "杉並区": "すぎなみく",
        "豊島区": "としまく",
        "北区": "きたく",
        "荒川区": "あらかわく",
        "板橋区": "いたばしく",
        "練馬区": "ねりまく",
        "足立区": "あだちく",
        "葛飾区": "かつしかく",
        "江戸川区": "えどがわく"
    ]
    
    func furigana(for city: String) -> String? {
        return cityData[city]
    }
}
